jamieboyd/msp430/libCmdInterp_2/libCmdInterp.c
/*************************************************************************************************
 *  libCMdInterp
 *  Library to interpret and run commands sent over UART. What commands are sent is up to you.
 *  Author: Jamie Boyd
 *  Created on: 2022/03/15
 *  Last Modified: 2022/03/22
 *  **************************************************************************************************/

#include <msp430.h> 
#include "libCmdInterp.h"

// for describing commands I know about
static CMDptr gCmdArrayPtr;                         // pointer to array of commands, will be initialized at start of program
static unsigned char gCmdArraySize = INIT_SIZE;     // size of the array of commands
static unsigned char gNumCommands = 0;              // number of commands, <= array size, or will be resized

// for describing errors I know about
static char ** gErrArrayPtr;                         // array of pointers to error strings, that's pointers to char pointers, will be initialized at start
static unsigned char gErrArraySize = INIT_SIZE;         // size of the array of errors
static unsigned char gNumErrs = 0;                           // number of distinct error messages, <= array size, or will be resized

// for getting user commands
volatile unsigned char gCmdCntIn=0;                    // number of command being processed, increments each time
char gCMDstrs[BUFF_SIZE * STR_SIZE];                // used to hold commands as entered by user, we do a single array and use pointer arithmetic to find start of string of interest
volatile unsigned char gInCmd = 0;                    // for circular buffer of commands we are processing
volatile unsigned char gOutCmd = 0;         // for circular buffer of commands we are processing
volatile unsigned char gCmdBufState = 0;      // 0 means empty, 1 means inProgress, 2 means full

// for parsing and executing user commands
CMDdata gCMDdata;                                  // structure used and re-used to pass data to each command, only need one

// for printing returned messages for each command
volatile unsigned char gCmdCntOut=0;
char gErrs [BUFF_SIZE * STR_SIZE];        // we do a single array and use pointer arithmetic to find start of string of interest
//volatile unsigned char gErrs [] = {5,5,5,5,5,5};     // used to hold indexes into our array of pre-made error message strings
volatile unsigned char gInErr =0;                   // for circular buffer of errors we are processing
volatile unsigned char gOutErr =0;         // for circular buffer of errors we are processing
volatile unsigned char gErrBufState = 0;      // 0 means empty, 1 means inProgress, 2 means full

volatile unsigned char gIsPrinting=0;                    // set when someone is printing to serial, or does not want anyone else to print right now
volatile unsigned char gStopPrinting=0;                   // set when someone would like the floor, asking others to stop printing

/******************************** libCMD_INIT ****************************************************
* Function: libCMD_INIT
* - Initializes UART and installs TX and RX interrupts, makes arrays for CMDs and results,
*   and adds first 5 error messages
* Arguments: 0
* returns: 0 for success, 1 if could not allocate memory for needed arrays
* Author: Jamie Boyd
* Date: 2022/03/16
************************************************************************************/
unsigned char libCMD_init (){
    unsigned char rVal = 0;     // successs
    usciA1UartInit(19200); // initialise UART for 19200 Baud communication
    gCmdArrayPtr = (CMD *)malloc (INIT_SIZE * sizeof (CMD));  // array of CMD structures, can be resized
    gErrArrayPtr = (char **)malloc (INIT_SIZE * sizeof (char *)); // array of pointers to static error strings
    if ((gCmdArrayPtr != NULL) && (gErrArrayPtr != NULL)){
        libCMD_addErr (ERR0);       // fill first 6 error messages
        libCMD_addErr (ERR1);
        libCMD_addErr (ERR2);
        libCMD_addErr (ERR3);
        libCMD_addErr (ERR4);
        libCMD_addErr (ERR5);
        usciA1UartInstallRxInt (&libCMD_RxInterrupt);   // install UART interrupts
        usciA1UartInstallTxInt (&libCMD_TxInterrupt);
        usciA1UartEnableRxInt (1);                      // enable Rx interrupt right away
        usciA1UartEnableTxInt (0);
        usciA1UartTxString ("Press any key and wait for prompt\r\0");           // always wanted to say "Press any key to continue"
        _enable_interrupts();                           // enable interrupts
    }else{
        usciA1UartTxString ("Command Interpreter failed to make buffers\r\0");
        rVal = 1;
    }
    return rVal;
}

/************************************************************************************
* Function: libCMD_addCmd
* - Adds a command to the list of commands I recognize
* Arguments: 4
* cmdNameP - name of the command to be sent by UART
* nArgsP - number of numeric arguments, always first in parameter list
* nStrArgsP - number of string arguments, always last in parameter list
* theCommandP - function pointer to function that takes a CMDdataPtr argument and returns an unsigned error code
* returns: 1 for success, 0 for error (if needs to allocate memory and can not)
* Author: Jamie Boyd
* Date: 2022/03/16
************************************************************************************/
unsigned char libCMD_addCmd (char * cmdNameP, unsigned char nArgsP, unsigned char nStrAgsP, unsigned char resultTypeP, command theCommandP){
    unsigned char rVall = 1;
    if (gNumCommands == gCmdArraySize){
        CMDptr newArray  = (CMDptr)malloc (gCmdArraySize * 2 * sizeof (CMD));
        if (newArray != NULL){
            unsigned char iMem;
            for (iMem=0;iMem < gCmdArraySize; iMem +=1){
                newArray [iMem] = gCmdArrayPtr [iMem];
            }
            gCmdArraySize *= 2;
            free (gCmdArrayPtr);
            gCmdArrayPtr = newArray;
        } else{
            rVall = 0;
        }
    }
    if (rVall == 1){
        gCmdArrayPtr[gNumCommands].name = cmdNameP;
        gCmdArrayPtr[gNumCommands].theCommand = theCommandP;
        gCmdArrayPtr[gNumCommands].nArgs = nArgsP;
        gCmdArrayPtr[gNumCommands].nStrArgs = nStrAgsP;
        gCmdArrayPtr[gNumCommands].resultType = resultTypeP;
        gNumCommands +=1;
    }
    return rVall;
}

/************************************************************************************
* Function: libCMD_addErr
* - Adds an error to the list of errors I know about.
* - ErrStr can not be string literal - it must have an address and keep existing after function returns
* - because characters are not copied, just the address
* Arguments: 1
* errStr - pointer to the character string that is your error message
* returns: offset to this error in the error string array, or 0 if needed to allocate and could not
* Author: Jamie Boyd
* Date: 2022/03/16
************************************************************************************/
unsigned char libCMD_addErr (char * errStr){
    unsigned char rVal =1;
    if (gNumErrs == gErrArraySize){
        char ** newArray = (char **)malloc (gErrArraySize * 2 * sizeof (char *));
        if (newArray != NULL){
            unsigned char iMem;
            for (iMem=0;iMem < gErrArraySize; iMem +=1){
                newArray [iMem] = gErrArrayPtr [iMem];
            }
            gErrArraySize *= 2;
            free (gErrArrayPtr);
            gErrArrayPtr = newArray;
        }else{
            rVal = 0;
        }
    }
    if (rVal ==1){
        gErrArrayPtr [gNumErrs] = errStr;
        rVal = gNumErrs;  // offset to this error
        gNumErrs +=1;
    }
    return rVal;
}

