jamieboyd/msp430/libCmdInterp_2/libCmdInterp.c
/*********************************** libCMD_run *************************************************
* Function: libCMD_run
* - main loop. Goes into low power mode. When woken, processes commands till command buffer is empty
* Arguments: None
* returns: Nothing
* Author: Jamie Boyd
* Date: 2022/03/10
*************************************************************************************/
void libCMD_run (void){

    while (1){
        __low_power_mode_0();
        while (gCmdBufState > BUFF_EMPTY){
            libCMD_doNextCommand ();
        }
    }
}


/*********************************** libCMD_doNextCommand *************************************************
* Function: libCMD_doNextCommand
* - parses next command line from user, filling out data in the CMDdata structure
*  using info from the command's entry in CMD list, then runs command function with parsed arguments,
*  and adds result to the print buffer
* Arguments: None
* returns: Nothing - lotsa side effects obviously
* Author: Jamie Boyd
* Date: 2022/02/10
*************************************************************************************/
 void libCMD_doNextCommand (void){
     static char * cmdLine = gCMDstrs;   // start at 1st command, then add STR_SIZE size each time through
     static char * resLine = gErrs;      // start at first result, then add STR_SIZE each time through
    // used by string tokenizing
    char * contextPtr = NULL;   // always starts off NULL do tokenizer knows it is first string
    char * aToken;              // used for string tokenizer
    // for dealing with tokenized arguments
    unsigned char cmdIndex;      // index into commands, as found by validateCMD, or -1 for not found
    signed int argVal;         // all numeric arguments are unsigned ints
    unsigned char ii;        // to iterate through commands, and arguments as they get tokenized
    unsigned char errVal;     // 0 for success or an error code
    command theCommand;        // the function to run, with signature defined in typedef for command function
    unsigned int resultType =0;
    float * dataPtr;
    if (gCmdBufState > BUFF_EMPTY){
        // see if command name exists
        aToken = libCMD_strTok (cmdLine, &contextPtr); // first token contains command name.
        errVal = 1;         // start with 1, code for command not exists
        for (ii =0; ii < gNumCommands; ii +=1){
            if (libCMD_strCmp(aToken, (char *)gCmdArrayPtr[ii].name)){
                cmdIndex = ii;
                errVal =0;
                break;
            }
        }
        if (errVal == 0){     // command was found
            // get numeric args, if any
            for (ii =0; ii < gCmdArrayPtr[(unsigned int)cmdIndex].nArgs; ii +=1){
                aToken = libCMD_strTok (NULL, &contextPtr);
                if (aToken != NULL){
                    argVal = libCMD_parseArg (aToken, &errVal);     // errVal is set if number can't be tokenized
                    if (errVal == 0){
                        gCMDdata.args[ii] = argVal;
                    }else{
                        break;
                    }
                }else{        // not enough numeric arguments
                    errVal = 2;
                    break;
                }
            }
            if (errVal == 0){
                // get string args, if any
                for (ii =0; ii < gCmdArrayPtr[cmdIndex].nStrArgs; ii +=1){
                    aToken = libCMD_strTok (NULL, &contextPtr);
                    if (aToken != NULL){
                        libCMD_strCpy (aToken, gCMDdata.strArgs[ii]);
                    }else{        // not enough string arguments
                        errVal = 4;
                        break;
                    }
                }
                if (errVal == 0){     // this next read SHOULD be NULL
                    aToken = libCMD_strTok (NULL, &contextPtr);
                    if (aToken != NULL){
                        errVal = 5;    // too many args
                    }
                    if (errVal == 0){     // finally, run the command if no error so far
                        theCommand = gCmdArrayPtr[(unsigned char)cmdIndex].theCommand;
                        errVal = theCommand (&gCMDdata); // run the command with the data that was parsed, get result to print
                        resultType = gCmdArrayPtr[(unsigned char)cmdIndex].resultType;
                    }
                }
            }
        }
    }

    if ((errVal > 0) || (resultType ==0)){       // print error/result message
        sprintf ((char *)resLine, "CMD %d->%s\r\0",  gCmdCntOut, gErrArrayPtr[errVal]); // err code matches index of error string
    }else{      // print return value
        switch (resultType){
        case R_UCHAR:
            sprintf (resLine, "CMD %d->%u\r\0",  gCmdCntOut, (unsigned char)gCMDdata.result);
            break;
        case R_SCHAR:
            sprintf (resLine, "CMD %d->%d\r\0",  gCmdCntOut, (signed char)gCMDdata.result);
            break;
        case R_UINT:
            sprintf (resLine, "CMD %d->%hu\r\0",  gCmdCntOut, (unsigned int)gCMDdata.result);
            break;
        case R_SINT:
            sprintf (resLine, "CMD %d->%hd\r\0",  gCmdCntOut, (signed int)gCMDdata.result);
            break;
        case R_ULONG:
            sprintf (resLine, "CMD %d->%lu\r\0",  gCmdCntOut, (unsigned long int)gCMDdata.result);
            break;
        case R_SLONG:
            sprintf (resLine, "CMD %d->%ld\r\0",  gCmdCntOut, (signed long int)gCMDdata.result);
            break;
        case R_FLOAT:
            dataPtr = (float *)&gCMDdata.result;
            sprintf (resLine, "CMD %d->%.2f\r\0",  gCmdCntOut, *dataPtr);
            break;
        case R_STRING:
            sprintf (resLine, "CMD %d->%s\r\0",  gCmdCntOut, (char *)gCMDdata.result);
        }
    }
//    usciA1UartTxString (resLine);
    gCmdCntOut +=1;

    // increment out position in buffer of commands, cause we processed one
     gOutCmd += 1;
     cmdLine += STR_SIZE;
    if (gCmdBufState == BUFF_FULL){  //  command buffer state was full,, now room for one more
        gCmdBufState = BUFF_AVAIL;
    }
    if (gOutCmd == BUFF_SIZE){
        gOutCmd = 0;
        cmdLine = gCMDstrs;
    }
    if (gOutCmd == gInCmd){
        gCmdBufState = BUFF_EMPTY;
    }
    // increment in position in buffer of errMsgs to be printed, cause we added one
    gInErr +=1;
    resLine += STR_SIZE;
    if (gErrBufState == BUFF_EMPTY){     // error buffer was empty, now has 1 message in it
        gErrBufState = BUFF_AVAIL;
     }
    if (gInErr == BUFF_SIZE){
        gInErr = 0;
        resLine = gErrs;
    }
    if (gInErr == gOutErr){
        gErrBufState = BUFF_FULL;
    }
    if (!(gIsPrinting)){
            usciA1UartEnableTxInt (1);
            gIsPrinting = 1;
    }
}


