jamieboyd/msp430/libCmdInterp_2/libCmdInterp.c
 /*********************************** libCMD_RxInterrupt *************************************************
 * Function: libCMD_RxInterrupt
 * - runs when a character is received. Adds it to the buffer of command strings.
 * - Does NOT echo character - host computer terminal app must have echo on
 * Arguments: 1
 *   RXBUF - the character in the buffer
 * returns: 1 if a command has been entered and is ready to process, else 0
 * Author: Jamie Boyd
 * Date: 2022/03/20
 *************************************************************************************/
unsigned char libCMD_RxInterrupt (char  RXBUF){
    static unsigned int rCharCount = 255;    // count of characters in command buffer, 255 is start signal condition
    static char * cmdPtr = gCMDstrs;         // pointer will kept pointing to start of current result message, incremented by STR_SIZE at end
    static char promptStr [15];             // small string buffer for command prompt
    unsigned char lpm =0;                   // return value, will be set to 1 to wake from low power mode at end of a command
    if (gCmdBufState < 2){                  // Buffer is not full, we can accept new commands
        if (rCharCount == 255){              // signal value for start of a new command
            gStopPrinting = 1;              // not a good time to be printing to host - user just started entering a command
            while (gIsPrinting){};
            gIsPrinting = 1;
            gStopPrinting = 0;
            sprintf (promptStr,"\bCMD %d:\0", gCmdCntIn); // display prompt for user, back-apcing over character used to get our attention
            usciA1UartTxString (promptStr);
            rCharCount =0;                       // reset char count to 0
        } else{                                 // in the middle of a command
            if (RXBUF == 127) {                  // delete key, so delete previous char in buffer, by decrementing count
                if (rCharCount > 0){
                    rCharCount -= 1;
                }
            } else{
                if (rCharCount == (STR_SIZE - 1)){                       // this command is full, and its last char is not \r.  Reset
                   sprintf (promptStr,"\r< %d chars!\r\0", rCharCount);    // tell user that buffer was exceeded
                   usciA1UartTxString (promptStr);
                   sprintf (promptStr,"CMD %d:\0", gCmdCntIn); // display new command prompt for user
                   usciA1UartTxString (promptStr);
                   rCharCount =0;
               }else{
                   if (RXBUF == '\r'){                     // command fully entered
                       lpm = 1;                            // set lpm to wake from low power mode
                       gCmdCntIn +=1;
                       // gCMDstrs [gInCmd * charCount] = '\0';
                       *(cmdPtr + rCharCount) = '\0';        // null terminate the string
                       rCharCount = 255;                              // reset char count
                       gInCmd += 1;                                   // increment gInCmd
                       cmdPtr += STR_SIZE;
                       if (gInCmd == BUFF_SIZE){
                           gInCmd = 0;
                           cmdPtr = gCMDstrs;
                       }
                       if (gCmdBufState == BUFF_EMPTY){
                           gCmdBufState = BUFF_AVAIL;
                       }
                       if (gInCmd == gOutCmd){
                           gCmdBufState = BUFF_FULL;
                       }
                       if (gErrBufState > BUFF_EMPTY){   // we can allow some printing now, so turn on Tx interrupt if err buffer is not empty
                           usciA1UartEnableTxInt (1);
                       }else{
                           gIsPrinting = 0;
                       }
                   }else{                                  // command not fully entered yet
                        *(cmdPtr + rCharCount++) = RXBUF; // add received char to buffer, post-increment character count
                    }
                }
            }
        }
    }
   return lpm;
}

/******************************** libCMD_TxInterrupt ****************************************************
* Function: libCMD_TxInterrupt prints results messages from buffer
* - Called when it is enabled and TXBUF is empty. disables itself when result buffer is empty
* Arguments: 1
*   lpm  - pointer to an unsigned char which can be set to 1 to wake from low power mode, but we always leave it at 0
* returns: the next character from the global gErrStr
* Author: Jamie Boyd
* Date: 2022/03/16
************************************************************************************/
char libCMD_TxInterrupt (unsigned char* lpm){
    static unsigned char tCharCount=0;
    static char * errPtr = gErrs;
    char rChar;
    rChar = *(errPtr + tCharCount++) ;    // get next char in this result message, and increment char count
    if (*(errPtr + tCharCount) == '\0'){  // next char is terminator, so this string is done
        tCharCount = 0;
        gOutErr += 1;
        errPtr += STR_SIZE;
        if (gOutErr == BUFF_SIZE){  // wrap around to start of buffer
            gOutErr = 0;
            errPtr = gErrs;
        }
        if (gErrBufState == BUFF_FULL){  // err buffer was full
            gErrBufState = BUFF_AVAIL;    // but not any more
        }
        if (gOutErr == gInErr){  // buffer is empty
           gErrBufState = BUFF_EMPTY;
        }
        if ((gStopPrinting ==1) || (gErrBufState == BUFF_EMPTY)){
              gIsPrinting = 0;
            usciA1UartEnableTxInt (0);  // disable tx interrupt
        }
    }
    return rChar;
}


/*************************************libCMD_strTok***********************************************
* Function: libCMD_strTok
* - a custom string tokenizer. Works on null-terminated string with separators (space, comma, tab)
* Arguments: 2
* argument 1: buffer - on first call, pass pointer to text buffer to be tokenized, subsequently pass NULL
* argument 2: contextP, address of a char pointer. Set on 1st call to end of token and used on subsequent calls
* returns: pointer to tokenized portion of string, or NULL if no tokens left in string
* Author: Jamie Boyd
* Date: 2022/02/10
************************************************************************************/
char * libCMD_strTok (char * stringWithSeps, char** contextP){
    if (stringWithSeps == NULL){ // this is a repeated call and contextPtr MUST be set
        if (*contextP == NULL){ // so check that it is not null, and return null if so
            return NULL;
        }
    }else{                           // this is the first call to strTok for this string
        *contextP = stringWithSeps;  // so initialize contextP to start of string
    }
    // check if we are at end of string
    if (**contextP == '\0'){
        return NULL;
    }
    // skip over any extra delimiters at start of string
    while ((((**contextP == ' ') || (**contextP == ',')) || (**contextP == '\t')) && (**contextP != '\0')){
        *contextP +=1;
    }
    if (**contextP == '\0'){ // we do not have another token
        return NULL;
    }else{ // we do have a token, get ready to return it
        stringWithSeps = *contextP;
        // look for delimiter at end of token, or \0 for end of string
        while ((((**contextP != ' ') && (**contextP != ',')) && (**contextP != '\t')) && (**contextP != '\0')){
            *contextP +=1;
        }
        if (**contextP != '\0'){
            **contextP = '\0'; // write terminator over first separator character
            *contextP +=1;   // increment pointer to start of next token, for next call
        }
        return stringWithSeps;
    }
}

/************************************************************************************
* Function: libCMD_strCmp
* -  Compares two strings and returns the truth that they are equivalent
* Arguments: 2
* argument 1: string 1
* argument 2: string 2
* returns: 1 if strings are equivalent, 0 if they are not
* Author: Jamie Boyd
* Date: 2022/02/10
* ***********************************************************************************/
unsigned char libCMD_strCmp (char * str1, char * str2){
    while ((*str1 == *str2) && (!(*str1 == '\0' || *str2 == '\0'))){
        str1 +=1;
        str2 +=1;
    }
    return ((*str1 == '\0') && (*str2 == '\0'));
}

/************************************************************************************
* Function: libCMD_strCpy
* -  copies the contents of string str1 to string str2
* Arguments: 2
* argument 1: string 1
* argument 2: string 2
* returns: nothing
* Author: Jamie Boyd
* Date: 2022/02/10
* ***********************************************************************************/
void libCMD_strCpy (char * str1, char * str2){
    while (*str1 != '\0'){
        *str2++ = *str1++;
    }
    *str2 = '\0';
}

/******************************* libCMD_parseArg *****************************************************
* Function: libCMD_parseArg, basically AtoI with extras for msp430
* -  parses a string representing a decimal, hex, or binay value, returning the number as a signed integer
* - because any value can be good data, a pass-by-reference argument is needed for error reporting
* Arguments: 2
* aToken: a null-terminated string containing the value
* err: a pass-by-reference value to set if an error occurs
* returns: signed int corresponding to the value
* Author: Jamie Boyd
* Date: 2022/01/15
* Modified:2022/01/23 by Jamie Boyd - now does 000110b style binary and checks for negative sign on decimals
* Modified:2022/02/14 by Jamie Boyd - made power an unsigned int to enable larger values
* ***********************************************************************************/
signed int libCMD_parseArg (char * aToken, unsigned char * err){
    signed char tokLen, tokPos;
    unsigned char decTokEnd;
    unsigned int power;
    signed int rVal =0;
    *err =0;
    for (tokLen = 0; *(aToken + tokLen) != '\0'; tokLen +=1){}; // find token length so we can work backwards
    if ((*aToken == '0') && (*(aToken + 1) == 'x')){ // we have hex digit, note the x is case sensitive
        for (power=1, tokPos = tokLen -1; tokPos >= 2; tokPos -=1, power *= 16){
            if ((*(aToken + tokPos) >= '0') && (*(aToken + tokPos) <= '9')){
                rVal += (*(aToken + tokPos) - 48) * power;
            }else{
                if ((*(aToken + tokPos) >= 'A') && (*(aToken + tokPos) <= 'F')){ // note case sensitive
                    rVal += (*(aToken + tokPos) - 55) * power;
                }else{
                    *err = 3;    // error parsing number
                    break;
                }
            }
        }
    }else{
        if(*(aToken + tokLen-1) == 'b'){    // we have binary values, note the b is case sensitive
            for (power=1, tokPos = tokLen-2; tokPos >= 0; tokPos -=1, power *= 2){
                if (*(aToken + tokPos) == '1') {
                    rVal += power;
                }else{
                   if (*(aToken + tokPos) != '0'){
                       *err = 3;
                       break;
                   }
                }
            }
        } else{     // we have decimal values
            if (*aToken == '-'){
                decTokEnd = 1;      // negative value
            }else{
                decTokEnd = 0;
            }

            for (power=1, tokPos = tokLen-1; tokPos >= decTokEnd; tokPos -=1, power *= 10){
               if ((*(aToken + tokPos) >= '0') && (*(aToken + tokPos) <= '9')){
                   rVal += (*(aToken + tokPos) - 48) * power;
               }else{
                   *err = 3; // error parsing number
                   break;
               }
            }
            if (decTokEnd == 1){
                rVal *= -1;
          }
        }
    }
    return rVal;     // data will only be valid if *err is 0
}

/************************************************************************************
* Function: validateCmd
* - searches through command names in command list looking for a match
* Arguments: 2
* argument 1: cmdList - the list of commands with names
* argument 2: a name
* returns: index of command with matching name, or -1 if no match was found
* Author: Jamie Boyd
* Date: 2022/02/10
************************************************************************************/
signed char libCMD_validateCmd(CMD * cmdList ,char * cmdName) {
    unsigned char ii;
    signed char cmdIndex = -1;
    for (ii =0; ii < gNumCommands; ii +=1){
        if (libCMD_strCmp(cmdName, (char *)cmdList[ii].name)){
            cmdIndex = ii;
            break;
        }
    }
    return cmdIndex;
}
